---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.CurveByPointFailures
source: html/a6890a33-cda5-aade-276f-67b90a9b167b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurveByPointFailures

Failures about Curve By Point Element

## Syntax (C#)
```csharp
public static class CurveByPointFailures
```